---
type: TextNode
namespace: Autodesk.Revit.DB
version: 2024
members: 19
tags: [revit-api, class]
---

# TextNode

`Autodesk.Revit.DB.TextNode` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetFormattedText | 2017 | `public FormattedText GetFormattedText ()` |
| Property | BaseDirection | 2016 | `public XYZ BaseDirection { get ; }` |
| Property | Color | 2016 | `public Color Color { get ; }` |
| Property | FontHeight | 2016 | `public double FontHeight { get ; }` |
| Property | FontName | 2016 | `public string FontName { get ; }` |
| Property | Height | 2016 | `public double Height { get ; }` |
| Property | HorizontalAlignment | 2016 | `public HorizontalTextAlignment HorizontalAlignment { get ; }` |
| Property | IsBold | 2016 | `public bool IsBold { get ; }` |
| Property | IsItalic | 2016 | `public bool IsItalic { get ; }` |
| Property | IsKeptReadable | 2016 | `public bool IsKeptReadable { get ; }` |
| Property | IsTransparent | 2016 | `public bool IsTransparent { get ; }` |
| Property | IsUnderlined | 2016 | `public bool IsUnderlined { get ; }` |
| Property | Position | 2016 | `public XYZ Position { get ; }` |
| Property | TabSize | 2016 | `public double TabSize { get ; }` |
| Property | Text | 2016 | `public string Text { get ; }` |
| Property | UpDirection | 2016 | `public XYZ UpDirection { get ; }` |
| Property | VerticalAlignment | 2016 | `public VerticalTextAlignment VerticalAlignment { get ; }` |
| Property | Width | 2016 | `public double Width { get ; }` |
| Property | WidthScale | 2016 | `public double WidthScale { get ; }` |